// src/config/puzzles.ts

import { GameState } from '../types';

// Экспортируем объект с различными уровнями для удобства тестирования.
export const puzzles = {
  // Пазл из тестового задания.
  // Пробирки пронумерованы с 0 до 13.
  // Цвета внутри пробирок указаны снизу вверх.
  example: [
    /* 0 */ [4, 4, 10, 2],
    /* 1 */ [8, 12, 8, 1],
    /* 2 */ [9, 5, 7, 10],
    /* 3 */ [5, 2, 3, 6],
    /* 4 */ [7, 8, 11, 12],
    /* 5 */ [2, 12, 1, 8], // <--- ИСПРАВЛЕНО ЗДЕСЬ
    /* 6 */ [11, 7, 12, 4],
    /* 7 */ [10, 11, 3, 1],
    /* 8 */ [10, 7, 9, 9],
    /* 9 */ [6, 2, 6, 11],
    /* 10 */ [4, 6, 9, 3],
    /* 11 */ [5, 3, 12, 1],
    /* 12 */ [], // Пустая
    /* 13 */ [], // Пустая
  ] as GameState,

  // Очень простой пазл для быстрой проверки и отладки алгоритма.
  simple: [
    [1, 2],
    [2, 1],
    [],
  ] as GameState,
};